<p align="center">
<img src="https://cdn.datacamp.com/main-app/assets/brand/datacamp-horizontal-rgb-b641f95b7bdd7560b554c761a0b4910f9619907dd823c0e41244ed72078723bf.svg" alt = "DataCamp icon" width="50%">
</p>
<br><br>

## **How to transition from Spreadsheets to Python**

Welcome to this live, hands-on training where you will learn how to upgrade from being a spreadsheet user to using Python. 

In most organizations across all industries, data fluency, technical skills and a data-driven mindset are becoming sought after skills that drive organizational success in the digital age. This shift has spurred on the adoption of tools that go beyond spreadsheets, which allow for more robust data analysis, visualization and presentation. In this notebook, you will learn:

* How to import Excel files into `pandas`.
* Filter, add new columns, and explore DataFrames.
* Apply common spreadsheets operations such as pivot tables and VLOOKUP in Python.
* Present data as visualizations using `matplotlib` and `seaborn`.

The dataset to be used in this webinar is an Excel file named `sales_data_dirty.xlsx` - it contains 4 sheets, each containing the following columns:

<br>



![alt](https://github.com/adelnehme/python-for-spreadsheet-users-webinar/blob/master/image.png?raw=true)

In [1]:
# Import relevant packages
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Import the data
data = pd.ExcelFile('https://github.com/adelnehme/python-for-spreadsheet-users-webinar/blob/master/sales_data_dirty.xlsx?raw=true')

In [6]:
# Print the name of the sheets
#type(data)
data.sheet_names

['sales', 'customers', 'dates', 'employees']

In [8]:
# Parse sales data
sales = data.parse('sales')
# Print dimensions and glimpse
print(sales.shape)
sales.head(5)

(31465, 5)

   SalesOrderID    TotalDue  NumberofItems  OnlineOrderFlag  Status
0         43659  23153.2339             12                0       5
1         43660   1457.3288              2                0       5
2         43661  36865.8012             15                0       5
3         43662  32474.9324             22                0       5
4         43663    472.3108              1                0       5

In [9]:
# Parse customers data 
customers = data.parse('customers')
# Print dimensions and glimpse
print(customers.shape)
customers.head(5)

(31465, 6)

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
0,43659,NaN,NaN,Tsvi,Reiter,NaN
1,43660,NaN,NaN,Tsvi,Reiter,NaN
2,43661,NaN,NaN,José,Saraiva,NaN
3,43662,NaN,NaN,José,Saraiva,NaN
4,43663,NaN,NaN,Linda,Mitchell,NaN

In [12]:
# Parse dates data
dates = data.parse('dates')
# Print dimensions and glimpse
print(dates.shape)
dates.head(5)

(31465, 3)

   SalesOrderID            OrderDate             ShipDate
0         43659  2011-05-31 00:00:00  2011-06-07 00:00:00
1         43660  2011-05-31 00:00:00  2011-06-07 00:00:00
2         43661  2011-05-31 00:00:00  2011-06-07 00:00:00
3         43662  2011-05-31 00:00:00  2011-06-07 00:00:00
4         43663  2011-05-31 00:00:00  2011-06-07 00:00:00

In [13]:
# Parse employees data
employees = data.parse('employees')
# Print dimensions and glimpse
print(employees.shape)
employees.head(5)

(17, 5)

  FirstName  LastName CountryCode      RegionName  CommissionPct
0       Amy   Alberts          GB  United Kingdom          0.000
1     David  Campbell          US       Northwest          0.012
2   Garrett    Vargas          CA          Canada          0.010
3       Jae       Pak          CA          Canada          0.020
4   Jillian    Carson          US       Southwest          0.015

## **Better understanding our data**

In [17]:
# Understand missingness of sales data
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 5 columns):
SalesOrderID       31465 non-null int64
TotalDue           31465 non-null float64
NumberofItems      31465 non-null int64
OnlineOrderFlag    31465 non-null int64
Status             31465 non-null int64
dtypes: float64(1), int64(4)
memory usage: 1.2 MB

In [15]:
# Understand distribution of sales data
sales.describe()

       SalesOrderID       TotalDue  NumberofItems  OnlineOrderFlag   Status
count  31465.000000   31465.000000   31465.000000     31465.000000  31465.0
mean   59391.000000    3915.995109       3.855617         0.879040      5.0
std     9083.307446   12515.462713       7.214877         0.326086      0.0
min    43659.000000       1.518300       1.000000         0.000000      5.0
25%    51525.000000      62.951900       1.000000         1.000000      5.0
50%    59391.000000     865.204000       2.000000         1.000000      5.0
75%    67257.000000    2615.490800       3.000000         1.000000      5.0
max    75123.000000  187487.825000      72.000000         1.000000      5.0

In [16]:
# Make sure Status column has no other unique values